app/controllers/users_controller.rb

def create
		@user = User.new
		@user.userid = params[:user][:userid]
		@user.charname = params[:user][:charname]
		@user.save!
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 22 May 2014 06:32:38 UTC +00:00], ["updated_at", Thu, 22 May 2014 06:32:38 UTC +00:00]]